src/main/webapp/WEB-INF/wsdl/EmpleadoService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 3.0.2 git-revision#91dd558. -->
<definitions targetNamespace="http://soap.example.com/" name="EmpleadoService" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:tns="http://soap.example.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://soap.example.com/" schemaLocation="EmpleadoService_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="registrarEmpleado">
    <part name="parameters" element="tns:registrarEmpleado"/>
  </message>
  <message name="registrarEmpleadoResponse">
    <part name="parameters" element="tns:registrarEmpleadoResponse"/>
  </message>
  <message name="obtenerEmpleado">
    <part name="parameters" element="tns:obtenerEmpleado"/>
  </message>
  <message name="obtenerEmpleadoResponse">
    <part name="parameters" element="tns:obtenerEmpleadoResponse"/>
  </message>
  <portType name="EmpleadoSOAPService">
    <operation name="registrarEmpleado">
      <input wsam:Action="http://soap.example.com/EmpleadoSOAPService/registrarEmpleadoRequest" message="tns:registrarEmpleado"/>
      <output wsam:Action="http://soap.example.com/EmpleadoSOAPService/registrarEmpleadoResponse" message="tns:registrarEmpleadoResponse"/>
    </operation>
    <operation name="obtenerEmpleado">
      <input wsam:Action="http://soap.example.com/EmpleadoSOAPService/obtenerEmpleadoRequest" message="tns:obtenerEmpleado"/>
      <output wsam:Action="http://soap.example.com/EmpleadoSOAPService/obtenerEmpleadoResponse" message="tns:obtenerEmpleadoResponse"/>
    </operation>
  </portType>
  <binding name="EmpleadoSOAPServicePortBinding" type="tns:EmpleadoSOAPService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="registrarEmpleado">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
    <operation name="obtenerEmpleado">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="EmpleadoService">
    <port name="EmpleadoSOAPServicePort" binding="tns:EmpleadoSOAPServicePortBinding">
      <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
    </port>
  </service>
</definitions>

